Curve element with zero length cannot be used as a splitter and ignored.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DividedSurfaceZeroLengthSplittingCurve { get; }
  Visual Basic
Public Shared ReadOnly Property DividedSurfaceZeroLengthSplittingCurve As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceZeroLengthSplittingCurve {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DividedSurfaceFailures Class
  Autodesk.Revit.DB Namespace